; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p11---int100n150-m25---int100c150---s155---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level11 level11)
(sum level0 level18 level18)
(sum level1 level4 level5)
(sum level1 level11 level12)
(sum level1 level18 level19)
(sum level2 level4 level6)
(sum level2 level11 level13)
(sum level2 level18 level20)
(sum level3 level4 level7)
(sum level3 level11 level14)
(sum level3 level18 level21)
(sum level4 level4 level8)
(sum level4 level11 level15)
(sum level4 level18 level22)
(sum level5 level4 level9)
(sum level5 level11 level16)
(sum level5 level18 level23)
(sum level6 level4 level10)
(sum level6 level11 level17)
(sum level6 level18 level24)
(sum level7 level4 level11)
(sum level7 level11 level18)
(sum level7 level18 level25)
(sum level8 level4 level12)
(sum level8 level11 level19)
(sum level8 level18 level26)
(sum level9 level4 level13)
(sum level9 level11 level20)
(sum level9 level18 level27)
(sum level10 level4 level14)
(sum level10 level11 level21)
(sum level10 level18 level28)
(sum level11 level4 level15)
(sum level11 level11 level22)
(sum level11 level18 level29)
(sum level12 level4 level16)
(sum level12 level11 level23)
(sum level12 level18 level30)
(sum level13 level4 level17)
(sum level13 level11 level24)
(sum level13 level18 level31)
(sum level14 level4 level18)
(sum level14 level11 level25)
(sum level14 level18 level32)
(sum level15 level4 level19)
(sum level15 level11 level26)
(sum level15 level18 level33)
(sum level16 level4 level20)
(sum level16 level11 level27)
(sum level16 level18 level34)
(sum level17 level4 level21)
(sum level17 level11 level28)
(sum level17 level18 level35)
(sum level18 level4 level22)
(sum level18 level11 level29)
(sum level18 level18 level36)
(sum level19 level4 level23)
(sum level19 level11 level30)
(sum level19 level18 level37)
(sum level20 level4 level24)
(sum level20 level11 level31)
(sum level20 level18 level38)
(sum level21 level4 level25)
(sum level21 level11 level32)
(sum level21 level18 level39)
(sum level22 level4 level26)
(sum level22 level11 level33)
(sum level22 level18 level40)
(sum level23 level4 level27)
(sum level23 level11 level34)
(sum level23 level18 level41)
(sum level24 level4 level28)
(sum level24 level11 level35)
(sum level24 level18 level42)
(sum level25 level4 level29)
(sum level25 level11 level36)
(sum level25 level18 level43)
(sum level26 level4 level30)
(sum level26 level11 level37)
(sum level26 level18 level44)
(sum level27 level4 level31)
(sum level27 level11 level38)
(sum level27 level18 level45)
(sum level28 level4 level32)
(sum level28 level11 level39)
(sum level29 level4 level33)
(sum level29 level11 level40)
(sum level30 level4 level34)
(sum level30 level11 level41)
(sum level31 level4 level35)
(sum level31 level11 level42)
(sum level32 level4 level36)
(sum level32 level11 level43)
(sum level33 level4 level37)
(sum level33 level11 level44)
(sum level34 level4 level38)
(sum level34 level11 level45)
(sum level35 level4 level39)
(sum level36 level4 level40)
(sum level37 level4 level41)
(sum level38 level4 level42)
(sum level39 level4 level43)
(sum level40 level4 level44)
(sum level41 level4 level45)

(connected l0 l1)
(fuelcost level11 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l1 l0)
(fuelcost level11 l1 l0)
(connected l1 l2)
(fuelcost level18 l1 l2)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level18 l2 l1)

(at t0 l1)
(fuel t0 level45)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l0)
(at p3 l1)
(at p4 l1)
(at p5 l0)
(at p6 l0)
(at p7 l1)
(at p8 l2)
(at p9 l0)
(at p10 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l0)
(at p2 l1)
(at p3 l2)
(at p4 l0)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l0)
(at p9 l1)
(at p10 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l0 level34 level11 level45)
   deleted: (at t0 l1) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level34)
   goals met: 0 of 11
2. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 11
3. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 11
4. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 11
5. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 11
6. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 11
7. (drive t0 l0 l1 level23 level11 level34)
   deleted: (at t0 l0) (fuel t0 level34)
   added: (at t0 l1) (fuel t0 level23)
   goals met: 0 of 11
8. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 1 of 11
9. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 2 of 11
10. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 11
11. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 4 of 11
12. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 4 of 11
13. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 4 of 11
14. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 4 of 11
15. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 4 of 11
16. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 4 of 11
17. (drive t0 l1 l2 level5 level18 level23)
   deleted: (at t0 l1) (fuel t0 level23)
   added: (at t0 l2) (fuel t0 level5)
   goals met: 4 of 11
18. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 4 of 11
19. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 5 of 11
20. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 6 of 11
21. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 7 of 11
22. (drive t0 l2 l0 level1 level4 level5)
   deleted: (at t0 l2) (fuel t0 level5)
   added: (at t0 l0) (fuel t0 level1)
   goals met: 7 of 11
23. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 8 of 11
24. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 9 of 11
25. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 10 of 11
26. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 11 of 11
